# YOLOv8 Helmet + Reflective Jacket Detection Custom Model

nc: 2  # 2 classes

backbone:
  - [-1, 1, GhostConv, [64, 3, 2]]  # 0 - P1/2
  - [-1, 1, SMyCoordAttention, [64, 64]]  # Attention after downsample
  - [-1, 1, GhostConv, [128, 3, 2]]  # 1 - P2/4
  - [-1, 1, SMyCoordAttention, [128, 128]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, SimAM, []]
  - [-1, 1, GhostConv, [256, 3, 2]]  # 3 - P3/8
  - [-1, 1, SMyCoordAttention, [256, 256]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SimAM, []]
  - [-1, 1, GhostConv, [512, 3, 2]]  # 5 - P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SimAM, []]
  - [-1, 1, GhostConv, [1024, 3, 2]]  # 7 - P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SimAM, []]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, ASPP, [1024]]  # Multi-scale ASPP
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]
